betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rtc.c
  /* Check RTC handler validity */
  if (hrtc == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(hrtc->Instance));
  ASSERT_PARAM(IS_RTC_CALIB_OUTPUT(hrtc->Init.OutPut));
  ASSERT_PARAM(IS_RTC_ASYNCH_PREDIV(hrtc->Init.AsynchPrediv));
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ASSERT_PARAM(IS_RTC_OUTPUT(hrtc->Init.OutPut));
  ASSERT_PARAM(IS_RTC_HOUR_FORMAT(hrtc->Init.HourFormat));
  ASSERT_PARAM(IS_RTC_SYNCH_PREDIV(hrtc->Init.SynchPrediv));
  ASSERT_PARAM(IS_RTC_OUTPUT_POL(hrtc->Init.OutPutPolarity));
  ASSERT_PARAM(IS_RTC_OUTPUT_TYPE(hrtc->Init.OutPutType));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if (USE_DAL_RTC_REGISTER_CALLBACKS == 1)
  if (hrtc->State == DAL_RTC_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hrtc->Lock = DAL_UNLOCKED;

    hrtc->AlarmAEventCallback          =  DAL_RTC_AlarmAEventCallback;        /* Legacy weak AlarmAEventCallback      */
    hrtc->Tamper1EventCallback         =  DAL_RTCEx_Tamper1EventCallback;     /* Legacy weak Tamper1EventCallback     */
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
    hrtc->AlarmBEventCallback          =  DAL_RTCEx_AlarmBEventCallback;      /* Legacy weak AlarmBEventCallback      */
    hrtc->TimeStampEventCallback       =  DAL_RTCEx_TimeStampEventCallback;   /* Legacy weak TimeStampEventCallback   */
    hrtc->WakeUpTimerEventCallback     =  DAL_RTCEx_WakeUpTimerEventCallback; /* Legacy weak WakeUpTimerEventCallback */
#if defined(RTC_TAMPER2_SUPPORT)
    hrtc->Tamper2EventCallback         =  DAL_RTCEx_Tamper2EventCallback;     /* Legacy weak Tamper2EventCallback     */
#endif /* RTC_TAMPER2_SUPPORT */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

    if (hrtc->MspInitCallback == NULL)
    {
      hrtc->MspInitCallback = DAL_RTC_MspInit;
    }
    /* Init the low level hardware */
    hrtc->MspInitCallback(hrtc);

    if (hrtc->MspDeInitCallback == NULL)
    {
      hrtc->MspDeInitCallback = DAL_RTC_MspDeInit;
    }
  }
#else /* USE_DAL_RTC_REGISTER_CALLBACKS */
  if (hrtc->State == DAL_RTC_STATE_RESET)
  {
    /* Allocate lock resource and initialize it */
    hrtc->Lock = DAL_UNLOCKED;

    /* Initialize RTC MSP */
    DAL_RTC_MspInit(hrtc);
  }
#endif /* USE_DAL_RTC_REGISTER_CALLBACKS */

  /* Set RTC state */
  hrtc->State = DAL_RTC_STATE_BUSY;

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /* Disable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

  /* Enter Initialization mode */
  status = RTC_EnterInitMode(hrtc);

  if (status == DAL_OK)
  {
    /* Clear RTC_CTRL TIMEFCFG, OUTSEL and POLCFG Bits */
    hrtc->Instance->CTRL &= ((uint32_t)~(RTC_CTRL_TIMEFCFG | RTC_CTRL_OUTSEL | RTC_CTRL_POLCFG));
    /* Set RTC_CTRL register */
    hrtc->Instance->CTRL |= (uint32_t)(hrtc->Init.HourFormat | hrtc->Init.OutPut | hrtc->Init.OutPutPolarity);

    /* Configure the RTC PSC */
    hrtc->Instance->PSC = (uint32_t)(hrtc->Init.SynchPrediv);
    hrtc->Instance->PSC |= (uint32_t)(hrtc->Init.AsynchPrediv << RTC_PSC_APSC_Pos);

    /* Exit Initialization mode */
    status = RTC_ExitInitMode(hrtc);
  }

  if (status == DAL_OK)
  {
    hrtc->Instance->TACFG &= (uint32_t)~RTC_OUTPUT_TYPE_PUSHPULL;
    hrtc->Instance->TACFG |= (uint32_t)(hrtc->Init.OutPutType);

    hrtc->State = DAL_RTC_STATE_READY;
  }

  /* Enable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

#else
  /* Waiting for synchro */
  status = DAL_RTC_WaitForSynchro(hrtc);
  if (status != DAL_OK)
  {
    /* Set RTC state */
    hrtc->State = DAL_RTC_STATE_ERROR;

    return DAL_ERROR;
  }

  /* Set Initialization mode */
  status = RTC_EnterInitMode(hrtc);
  if (status != DAL_OK)
  {
    /* Set RTC state */
    hrtc->State = DAL_RTC_STATE_ERROR;

    return DAL_ERROR;
  }
  else
  {
    /* Clear Flags Bits */
    CLEAR_BIT(hrtc->Instance->CTRL, (RTC_FLAG_OW | RTC_FLAG_ALRAF | RTC_FLAG_SEC));

    if (hrtc->Init.OutPut != RTC_OUTPUTSOURCE_NONE)
    {
      /* Disable the selected Tamper pin */
      CLEAR_BIT(BAKPR->CTRL, BAKPR_CTRL_TPFCFG);
    }

    /* Set the signal which will be routed to RTC Tamper pin*/
    MODIFY_REG(BAKPR->CLKCAL, (BAKPR_CLKCAL_CALCOEN | BAKPR_CLKCAL_ASPOEN | BAKPR_CLKCAL_ASPOSEL), hrtc->Init.OutPut);

    if (hrtc->Init.AsynchPrediv != RTC_AUTO_1_SECOND)
    {
      /* RTC Prescaler provided directly by end-user*/
      prescaler = hrtc->Init.AsynchPrediv;
    }
    else
    {
      /* RTC Prescaler will be automatically calculated to get 1 second timebase */
      /* Get the RTCCLK frequency */
      prescaler = DAL_RCMEx_GetPeriphCLKFreq(RCM_PERIPHCLK_RTC);

      /* Check that RTC clock is enabled*/
      if (prescaler == 0U)
      {
        /* Should not happen. Frequency is not available*/
        hrtc->State = DAL_RTC_STATE_ERROR;
        return DAL_ERROR;
      }
      else
      {
        /* RTC period = RTCCLK/(RTC_PSCRLD + 1) */
        prescaler = prescaler - 1U;
      }
    }

    /* Configure the RTC_PRLH / RTC_PRLL */
    MODIFY_REG(hrtc->Instance->PSCRLDH, RTC_PSCRLDH_PSCRLDH, (prescaler >> 16U));
    MODIFY_REG(hrtc->Instance->PSCRLDL, RTC_PSCRLDL_PSCRLDL, (prescaler & RTC_PSCRLDL_PSCRLDL));

    /* Wait for synchro */
    status = RTC_ExitInitMode(hrtc);
    if (status != DAL_OK)
    {
      hrtc->State = DAL_RTC_STATE_ERROR;

      return DAL_ERROR;
    }

