betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rtc.c
    /* Initialize date to 1st of January 2000 */
    hrtc->DateToUpdate.Year = 0x00U;
    hrtc->DateToUpdate.Month = RTC_MONTH_JANUARY;
    hrtc->DateToUpdate.Date = 0x01U;

    /* Set RTC state */
    hrtc->State = DAL_RTC_STATE_READY;
  }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  return status;
}

/**
  * @brief  DeInitializes the RTC peripheral
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @note   This function does not reset the RTC Backup Data registers.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTC_DeInit(RTC_HandleTypeDef *hrtc)
{
  DAL_StatusTypeDef status = DAL_ERROR;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(hrtc->Instance));

  /* Set RTC state */
  hrtc->State = DAL_RTC_STATE_BUSY;

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  /* Disable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

  /* Enter Initialization mode */
  status = RTC_EnterInitMode(hrtc);

  if (status == DAL_OK)
  {
    /* Reset RTC registers */
    hrtc->Instance->TIME = 0x00000000U;
    hrtc->Instance->DATE = (RTC_DATE_WEEKSEL_0 | RTC_DATE_MONU_0 | RTC_DATE_DAYU_0);
    hrtc->Instance->CTRL  &= 0x00000000U;
    hrtc->Instance->AUTORLD = RTC_AUTORLD_WUAUTORE;
    hrtc->Instance->PSC = (uint32_t)(RTC_PSC_APSC | 0x000000FFU);
    hrtc->Instance->DCAL = 0x00000000U;
    hrtc->Instance->ALRMA   = 0x00000000U;
    hrtc->Instance->ALRMB   = 0x00000000U;
    hrtc->Instance->CAL     = 0x00000000U;
    hrtc->Instance->SHIFT   = 0x00000000U;
    hrtc->Instance->ALRMASS = 0x00000000U;
    hrtc->Instance->ALRMBSS = 0x00000000U;

    /* Exit Initialization mode */
    status = RTC_ExitInitMode(hrtc);
  }

  /* Enable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

#else
  /* Set Initialization mode */
  status = RTC_EnterInitMode(hrtc);
  if (status != DAL_OK)
  {
    /* Set RTC state */
    hrtc->State = DAL_RTC_STATE_ERROR;

    /* Release Lock */
    __DAL_UNLOCK(hrtc);

    return DAL_ERROR;
  }
  else
  {
    CLEAR_REG(hrtc->Instance->CNTL);
    CLEAR_REG(hrtc->Instance->CNTH);
    WRITE_REG(hrtc->Instance->PSCRLDL, 0x00008000U);
    CLEAR_REG(hrtc->Instance->PSCRLDH);

    /* Reset All CRH/CRL bits */
    CLEAR_REG(hrtc->Instance->CTRL);
    CLEAR_REG(hrtc->Instance->CSTS);

    /* Exit Initialization mode */
    status = RTC_ExitInitMode(hrtc);
    if (status != DAL_OK)
    {
      hrtc->State = DAL_RTC_STATE_ERROR;

      /* Process Unlocked */
      __DAL_UNLOCK(hrtc);

      return DAL_ERROR;
    }
  }

  /* Wait for synchro*/
  DAL_RTC_WaitForSynchro(hrtc);

  /* Clear RSF flag */
  CLEAR_BIT(hrtc->Instance->CSTS, RTC_FLAG_RSF);

#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  if (status == DAL_OK)
  {
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
    /* Reset Tamper and alternate functions configuration register */
    hrtc->Instance->TACFG = 0x00000000U;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

#if (USE_DAL_RTC_REGISTER_CALLBACKS == 1)
    if (hrtc->MspDeInitCallback == NULL)
    {
      hrtc->MspDeInitCallback = DAL_RTC_MspDeInit;
    }

    /* DeInit the low level hardware: CLOCK, NVIC.*/
    hrtc->MspDeInitCallback(hrtc);
#else /* USE_DAL_RTC_REGISTER_CALLBACKS */
    /* De-Initialize RTC MSP */
    DAL_RTC_MspDeInit(hrtc);
#endif /* USE_DAL_RTC_REGISTER_CALLBACKS */

    hrtc->State = DAL_RTC_STATE_RESET;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrtc);

  return status;
}

#if (USE_DAL_RTC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Registers a User RTC Callback
  *         To be used instead of the weak predefined callback
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_RTC_ALARM_A_EVENT_CB_ID          Alarm A Event Callback ID
  *          @arg @ref DAL_RTC_ALARM_B_EVENT_CB_ID          Alarm B Event Callback ID  (*)
  *          @arg @ref DAL_RTC_TIMESTAMP_EVENT_CB_ID        Timestamp Event Callback ID  (*)
  *          @arg @ref DAL_RTC_WAKEUPTIMER_EVENT_CB_ID      Wakeup Timer Event Callback ID  (*)
  *          @arg @ref DAL_RTC_TAMPER1_EVENT_CB_ID          Tamper 1 Callback ID
  *          @arg @ref DAL_RTC_TAMPER2_EVENT_CB_ID          Tamper 2 Callback ID  (*)
  *          @arg @ref DAL_RTC_MSPINIT_CB_ID                Msp Init callback ID
  *          @arg @ref DAL_RTC_MSPDEINIT_CB_ID              Msp DeInit callback ID
  *          (*) This parameter is not available for APM32F402/403xx.
  * @note   DAL_RTC_TAMPER2_EVENT_CB_ID is not applicable to all devices.
  * @param  pCallback pointer to the Callback function
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTC_RegisterCallback(RTC_HandleTypeDef *hrtc, DAL_RTC_CallbackIDTypeDef CallbackID, pRTC_CallbackTypeDef pCallback)
{
  DAL_StatusTypeDef status = DAL_OK;

  if (pCallback == NULL)
  {
    return DAL_ERROR;
  }

  /* Process locked */
  __DAL_LOCK(hrtc);

  if (DAL_RTC_STATE_READY == hrtc->State)
  {
    switch (CallbackID)
    {
      case DAL_RTC_ALARM_A_EVENT_CB_ID :
        hrtc->AlarmAEventCallback = pCallback;
        break;

      case DAL_RTC_TAMPER1_EVENT_CB_ID :
        hrtc->Tamper1EventCallback = pCallback;
        break;

