betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rtc.c
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
      case DAL_RTC_ALARM_B_EVENT_CB_ID :
        hrtc->AlarmBEventCallback = pCallback;
        break;

      case DAL_RTC_TIMESTAMP_EVENT_CB_ID :
        hrtc->TimeStampEventCallback = pCallback;
        break;

      case DAL_RTC_WAKEUPTIMER_EVENT_CB_ID :
        hrtc->WakeUpTimerEventCallback = pCallback;
        break;

#if defined(RTC_TAMPER2_SUPPORT)
      case DAL_RTC_TAMPER2_EVENT_CB_ID :
        hrtc->Tamper2EventCallback = pCallback;
        break;
#endif /* RTC_TAMPER2_SUPPORT */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

      case DAL_RTC_MSPINIT_CB_ID :
        hrtc->MspInitCallback = pCallback;
        break;

      case DAL_RTC_MSPDEINIT_CB_ID :
        hrtc->MspDeInitCallback = pCallback;
        break;

      default :
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_RTC_STATE_RESET == hrtc->State)
  {
    switch (CallbackID)
    {
      case DAL_RTC_MSPINIT_CB_ID :
        hrtc->MspInitCallback = pCallback;
        break;

      case DAL_RTC_MSPDEINIT_CB_ID :
        hrtc->MspDeInitCallback = pCallback;
        break;

      default :
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrtc);

  return status;
}

/**
  * @brief  Unregisters an RTC Callback
  *         RTC callabck is redirected to the weak predefined callback
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref DAL_RTC_ALARM_A_EVENT_CB_ID          Alarm A Event Callback ID
  *          @arg @ref DAL_RTC_ALARM_B_EVENT_CB_ID          Alarm B Event Callback ID  (*)
  *          @arg @ref DAL_RTC_TIMESTAMP_EVENT_CB_ID        Timestamp Event Callback ID  (*)
  *          @arg @ref DAL_RTC_WAKEUPTIMER_EVENT_CB_ID      Wakeup Timer Event Callback ID  (*)
  *          @arg @ref DAL_RTC_TAMPER1_EVENT_CB_ID          Tamper 1 Callback ID
  *          @arg @ref DAL_RTC_TAMPER2_EVENT_CB_ID          Tamper 2 Callback ID  (*)
  *          @arg @ref DAL_RTC_MSPINIT_CB_ID Msp Init callback ID
  *          @arg @ref DAL_RTC_MSPDEINIT_CB_ID Msp DeInit callback ID
  *          (*) This parameter is not available for APM32F402/403xx.
  * @note   DAL_RTC_TAMPER2_EVENT_CB_ID is not applicable to all devices.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTC_UnRegisterCallback(RTC_HandleTypeDef *hrtc, DAL_RTC_CallbackIDTypeDef CallbackID)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Process locked */
  __DAL_LOCK(hrtc);

  if (DAL_RTC_STATE_READY == hrtc->State)
  {
    switch (CallbackID)
    {
      case DAL_RTC_ALARM_A_EVENT_CB_ID :
        hrtc->AlarmAEventCallback = DAL_RTC_AlarmAEventCallback;             /* Legacy weak AlarmAEventCallback    */
        break;

      case DAL_RTC_TAMPER1_EVENT_CB_ID :
        hrtc->Tamper1EventCallback = DAL_RTCEx_Tamper1EventCallback;         /* Legacy weak Tamper1EventCallback   */
        break;

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
      case DAL_RTC_ALARM_B_EVENT_CB_ID :
        hrtc->AlarmBEventCallback = DAL_RTCEx_AlarmBEventCallback;           /* Legacy weak AlarmBEventCallback */
        break;

      case DAL_RTC_TIMESTAMP_EVENT_CB_ID :
        hrtc->TimeStampEventCallback = DAL_RTCEx_TimeStampEventCallback;     /* Legacy weak TimeStampEventCallback    */
        break;

      case DAL_RTC_WAKEUPTIMER_EVENT_CB_ID :
        hrtc->WakeUpTimerEventCallback = DAL_RTCEx_WakeUpTimerEventCallback; /* Legacy weak WakeUpTimerEventCallback */
        break;

#if defined(RTC_TAMPER2_SUPPORT)
      case DAL_RTC_TAMPER2_EVENT_CB_ID :
        hrtc->Tamper2EventCallback = DAL_RTCEx_Tamper2EventCallback;         /* Legacy weak Tamper2EventCallback         */
        break;
#endif /* RTC_TAMPER2_SUPPORT */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

      case DAL_RTC_MSPINIT_CB_ID :
        hrtc->MspInitCallback = DAL_RTC_MspInit;
        break;

      case DAL_RTC_MSPDEINIT_CB_ID :
        hrtc->MspDeInitCallback = DAL_RTC_MspDeInit;
        break;

      default :
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else if (DAL_RTC_STATE_RESET == hrtc->State)
  {
    switch (CallbackID)
    {
      case DAL_RTC_MSPINIT_CB_ID :
        hrtc->MspInitCallback = DAL_RTC_MspInit;
        break;

      case DAL_RTC_MSPDEINIT_CB_ID :
        hrtc->MspDeInitCallback = DAL_RTC_MspDeInit;
        break;

      default :
        /* Return error status */
        status =  DAL_ERROR;
        break;
    }
  }
  else
  {
    /* Return error status */
    status =  DAL_ERROR;
  }

  /* Release Lock */
  __DAL_UNLOCK(hrtc);

  return status;
}
#endif /* USE_DAL_RTC_REGISTER_CALLBACKS */

/**
  * @brief  Initializes the RTC MSP.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval None
  */
__weak void DAL_RTC_MspInit(RTC_HandleTypeDef *hrtc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hrtc);

  /* NOTE: This function should not be modified, when the callback is needed,
           the DAL_RTC_MspInit could be implemented in the user file
   */
}

/**
  * @brief  DeInitializes the RTC MSP.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval None
  */
__weak void DAL_RTC_MspDeInit(RTC_HandleTypeDef *hrtc)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hrtc);

  /* NOTE: This function should not be modified, when the callback is needed,
           the DAL_RTC_MspDeInit could be implemented in the user file
   */
}

/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Group2 RTC Time and Date functions
  * @brief    RTC Time and Date functions
  *
@verbatim
 ===============================================================================
                 ##### RTC Time and Date functions #####
 ===============================================================================

 [..] This section provides functions allowing to configure Time and Date features

@endverbatim
  * @{
  */

/**
  * @brief  Sets RTC current time.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sTime Pointer to Time structure
  * @note   DayLightSaving and StoreOperation interfaces are deprecated.
  *         To manage Daylight Saving Time, please use DAL_RTC_DST_xxx functions.
  * @param  Format Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *            @arg RTC_FORMAT_BIN: Binary data format
  *            @arg RTC_FORMAT_BCD: BCD data format
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTC_SetTime(RTC_HandleTypeDef *hrtc, RTC_TimeTypeDef *sTime, uint32_t Format)
{
  uint32_t counter_time = 0U, counter_alarm = 0U;
  uint32_t tmpreg = 0U;
  DAL_StatusTypeDef status;

