betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_rtc.c
  UNUSED(counter_time);
  UNUSED(counter_alarm);
  UNUSED(tmpreg);

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_FORMAT(Format));
#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  ASSERT_PARAM(IS_RTC_DAYLIGHT_SAVING(sTime->DayLightSaving));
  ASSERT_PARAM(IS_RTC_STORE_OPERATION(sTime->StoreOperation));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Process Locked */
  __DAL_LOCK(hrtc);

  hrtc->State = DAL_RTC_STATE_BUSY;

#if defined(APM32F405xx) || defined(APM32F407xx) || defined(APM32F415xx) || defined(APM32F417xx) || defined(APM32F411xx) || defined(APM32F465xx) || \
    defined(APM32F423xx) || defined(APM32F425xx) || defined(APM32F427xx)
  if (Format == RTC_FORMAT_BIN)
  {
    if ((hrtc->Instance->CTRL & RTC_CTRL_TIMEFCFG) != 0U)
    {
      ASSERT_PARAM(IS_RTC_HOUR12(sTime->Hours));
      ASSERT_PARAM(IS_RTC_HOURFORMAT12(sTime->TimeFormat));
    }
    else
    {
      sTime->TimeFormat = 0x00U;
      ASSERT_PARAM(IS_RTC_HOUR24(sTime->Hours));
    }
    ASSERT_PARAM(IS_RTC_MINUTES(sTime->Minutes));
    ASSERT_PARAM(IS_RTC_SECONDS(sTime->Seconds));

    tmpreg = (uint32_t)(( (uint32_t)RTC_ByteToBcd2(sTime->Hours)   << RTC_TIME_HRU_Pos)  | \
                        ( (uint32_t)RTC_ByteToBcd2(sTime->Minutes) << RTC_TIME_MINU_Pos) | \
                        ( (uint32_t)RTC_ByteToBcd2(sTime->Seconds))                   | \
                        (((uint32_t)sTime->TimeFormat)             << RTC_TIME_TIMEFCFG_Pos));
  }
  else
  {
    if ((hrtc->Instance->CTRL & RTC_CTRL_TIMEFCFG) != 0U)
    {
      ASSERT_PARAM(IS_RTC_HOUR12(RTC_Bcd2ToByte(sTime->Hours)));
      ASSERT_PARAM(IS_RTC_HOURFORMAT12(sTime->TimeFormat));
    }
    else
    {
      sTime->TimeFormat = 0x00U;
      ASSERT_PARAM(IS_RTC_HOUR24(RTC_Bcd2ToByte(sTime->Hours)));
    }
    ASSERT_PARAM(IS_RTC_MINUTES(RTC_Bcd2ToByte(sTime->Minutes)));
    ASSERT_PARAM(IS_RTC_SECONDS(RTC_Bcd2ToByte(sTime->Seconds)));
    tmpreg = (((uint32_t)(sTime->Hours)      << RTC_TIME_HRU_Pos)  | \
              ((uint32_t)(sTime->Minutes)    << RTC_TIME_MINU_Pos) | \
              ((uint32_t) sTime->Seconds)                       | \
              ((uint32_t)(sTime->TimeFormat) << RTC_TIME_TIMEFCFG_Pos));
  }

  /* Disable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_DISABLE(hrtc);

  /* Enter Initialization mode */
  status = RTC_EnterInitMode(hrtc);

  if (status == DAL_OK)
  {
    /* Set the RTC_TIME register */
    hrtc->Instance->TIME = (uint32_t)(tmpreg & RTC_TIME_RESERVED_MASK);

    /* Clear the bits to be configured (Deprecated. Use DAL_RTC_DST_xxx functions instead) */
    hrtc->Instance->CTRL &= (uint32_t)~RTC_CTRL_BAKP;

    /* Configure the RTC_CTRL register (Deprecated. Use DAL_RTC_DST_xxx functions instead) */
    hrtc->Instance->CTRL |= (uint32_t)(sTime->DayLightSaving | sTime->StoreOperation);

    /* Exit Initialization mode */
    status = RTC_ExitInitMode(hrtc);
  }

  if (status == DAL_OK)
  {
    hrtc->State = DAL_RTC_STATE_READY;
  }

  /* Enable the write protection for RTC registers */
  __DAL_RTC_WRITEPROTECTION_ENABLE(hrtc);
#else
  if (Format == RTC_FORMAT_BIN)
  {
    ASSERT_PARAM(IS_RTC_HOUR24(sTime->Hours));
    ASSERT_PARAM(IS_RTC_MINUTES(sTime->Minutes));
    ASSERT_PARAM(IS_RTC_SECONDS(sTime->Seconds));

    counter_time = (uint32_t)(((uint32_t)sTime->Hours * 3600U) + \
                              ((uint32_t)sTime->Minutes * 60U) + \
                              ((uint32_t)sTime->Seconds));
  }
  else
  {
    ASSERT_PARAM(IS_RTC_HOUR24(RTC_Bcd2ToByte(sTime->Hours)));
    ASSERT_PARAM(IS_RTC_MINUTES(RTC_Bcd2ToByte(sTime->Minutes)));
    ASSERT_PARAM(IS_RTC_SECONDS(RTC_Bcd2ToByte(sTime->Seconds)));

    counter_time = (((uint32_t)(RTC_Bcd2ToByte(sTime->Hours)) * 3600U) + \
                    ((uint32_t)(RTC_Bcd2ToByte(sTime->Minutes)) * 60U) + \
                    ((uint32_t)(RTC_Bcd2ToByte(sTime->Seconds))));
  }

  /* Write time counter in RTC registers */
  status = RTC_WriteTimeCounter(hrtc, counter_time);
  if (status != DAL_OK)
  {
    /* Set RTC state */
    hrtc->State = DAL_RTC_STATE_ERROR;

    /* Process Unlocked */
    __DAL_UNLOCK(hrtc);

    return DAL_ERROR;
  }
  else
  {
    /* Clear Second and overflow flags */
    CLEAR_BIT(hrtc->Instance->CSTS, (RTC_FLAG_SEC | RTC_FLAG_OW));

    /* Read current Alarm counter in RTC registers */
    counter_alarm = RTC_ReadAlarmCounter(hrtc);

    /* Set again alarm to match with new time if enabled */
    if (counter_alarm != RTC_ALARM_RESETVALUE)
    {
      if (counter_alarm < counter_time)
      {
        /* Add 1 day to alarm counter*/
        counter_alarm += (uint32_t)(24U * 3600U);

        /* Write new Alarm counter in RTC registers */
        if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != DAL_OK)
        {
          /* Set RTC state */
          hrtc->State = DAL_RTC_STATE_ERROR;

          /* Process Unlocked */
          __DAL_UNLOCK(hrtc);

          return DAL_ERROR;
        }
      }
    }
  }

    hrtc->State = DAL_RTC_STATE_READY;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Process Unlocked */
  __DAL_UNLOCK(hrtc);

  return status;
}

/**
  * @brief  Gets RTC current time.
  * @param  hrtc pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sTime Pointer to Time structure
  * @param  Format Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *            @arg RTC_FORMAT_BIN: Binary data format
  *            @arg RTC_FORMAT_BCD: BCD data format
  @if APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx
  * @note  You can use SubSeconds and SecondFraction (sTime structure fields
  *        returned) to convert SubSeconds value in second fraction ratio with
  *        time unit following generic formula:
  *        Second fraction ratio * time_unit =
  *           [(SecondFraction - SubSeconds) / (SecondFraction + 1)] * time_unit
  *        This conversion can be performed only if no shift operation is pending
  *        (ie. SHFP=0) when PREDIV_S >= SS
  * @note  You must call DAL_RTC_GetDate() after DAL_RTC_GetTime() to unlock the
  *        values in the higher-order calendar shadow registers to ensure
  *        consistency between the time and date values.
  *        Reading RTC current time locks the values in calendar shadow registers
  *        until current date is read to ensure consistency between the time and
  *        date values.
  @endif
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_RTC_GetTime(RTC_HandleTypeDef *hrtc, RTC_TimeTypeDef *sTime, uint32_t Format)
{
  uint32_t tmpreg = 0U;
  uint32_t counter_time = 0U;
  uint32_t counter_alarm = 0U;
  uint32_t days_elapsed = 0U;
  uint32_t hours = 0U;

  UNUSED(tmpreg);
  UNUSED(counter_time);
  UNUSED(counter_alarm);
  UNUSED(days_elapsed);
  UNUSED(hours);

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_FORMAT(Format));

